jmeter/results/baseline/light-report/statistics.json
{
  "07 GET /api/patients?search= (name search)" : {
    "transaction" : "07 GET /api/patients?search= (name search)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 366.4299999999999,
    "medianResTime" : 354.0,
    "minResTime" : 267.0,
    "maxResTime" : 548.0,
    "pct1ResTime" : 436.9,
    "pct2ResTime" : 467.95,
    "pct3ResTime" : 547.98,
    "throughput" : 0.7525360464766262,
    "receivedKBytesPerSec" : 3.0642988551104726,
    "sentKBytesPerSec" : 0.35422106875169324
  },
  "02 GET / (index.html)" : {
    "transaction" : "02 GET / (index.html)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.8900000000000015,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 78.0,
    "pct1ResTime" : 4.900000000000006,
    "pct2ResTime" : 58.249999999999375,
    "pct3ResTime" : 77.95999999999998,
    "throughput" : 0.7544721335717465,
    "receivedKBytesPerSec" : 1.31001118504938,
    "sentKBytesPerSec" : 0.32713440166587443
  },
  "09 GET /api/appointments (day view)" : {
    "transaction" : "09 GET /api/appointments (day view)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 398.62999999999994,
    "medianResTime" : 383.0,
    "minResTime" : 313.0,
    "maxResTime" : 617.0,
    "pct1ResTime" : 468.5,
    "pct2ResTime" : 524.9,
    "pct3ResTime" : 616.6699999999998,
    "throughput" : 0.7575528014302597,
    "receivedKBytesPerSec" : 1.31314084232296,
    "sentKBytesPerSec" : 0.3403069225174995
  },
  "04 GET /assets/index.css" : {
    "transaction" : "04 GET /assets/index.css",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.069999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 79.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 46.799999999999955,
    "pct3ResTime" : 78.92999999999996,
    "throughput" : 0.7544892108042854,
    "receivedKBytesPerSec" : 36.81892612607515,
    "sentKBytesPerSec" : 0.33893070016598764
  },
  "05 GET /api/dashboard/stats" : {
    "transaction" : "05 GET /api/dashboard/stats",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 525.4699999999999,
    "medianResTime" : 518.0,
    "minResTime" : 468.0,
    "maxResTime" : 693.0,
    "pct1ResTime" : 578.9,
    "pct2ResTime" : 595.8499999999999,
    "pct3ResTime" : 692.7699999999999,
    "throughput" : 0.7516649378373096,
    "receivedKBytesPerSec" : 0.8713587706144108,
    "sentKBytesPerSec" : 0.33986412716667413
  },
  "10 POST /api/ai/pre-appointment/{id}" : {
    "transaction" : "10 POST /api/ai/pre-appointment/{id}",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3198.2000000000003,
    "medianResTime" : 3066.0,
    "minResTime" : 1500.0,
    "maxResTime" : 5782.0,
    "pct1ResTime" : 5583.700000000001,
    "pct2ResTime" : 5782.0,
    "pct3ResTime" : 5782.0,
    "throughput" : 0.09170610028979127,
    "receivedKBytesPerSec" : 0.19698900214592274,
    "sentKBytesPerSec" : 0.04384697920105646
  },
  "01 POST /api/auth/login" : {
    "transaction" : "01 POST /api/auth/login",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 70.00000000000003,
    "medianResTime" : 65.0,
    "minResTime" : 59.0,
    "maxResTime" : 158.0,
    "pct1ResTime" : 92.0,
    "pct2ResTime" : 98.79999999999995,
    "pct3ResTime" : 157.51999999999975,
    "throughput" : 0.7538635506973238,
    "receivedKBytesPerSec" : 1.0814702695062193,
    "sentKBytesPerSec" : 0.3837783876743309
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 910,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 719.8076923076926,
    "medianResTime" : 168.0,
    "minResTime" : 1.0,
    "maxResTime" : 5782.0,
    "pct1ResTime" : 3732.7999999999993,
    "pct2ResTime" : 4751.45,
    "pct3ResTime" : 5434.12,
    "throughput" : 6.391436879293149,
    "receivedKBytesPerSec" : 391.05434235801886,
    "sentKBytesPerSec" : 2.9287135301802247
  },
  "03 GET /assets/index.js (main bundle)" : {
    "transaction" : "03 GET /assets/index.js (main bundle)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.460000000000001,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 64.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 63.76999999999988,
    "throughput" : 0.7544778258966969,
    "receivedKBytesPerSec" : 359.97949588620963,
    "sentKBytesPerSec" : 0.3381887911001796
  },
  "08 GET /api/patients/{id} (record with history)" : {
    "transaction" : "08 GET /api/patients/{id} (record with history)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4676.819999999996,
    "medianResTime" : 4684.0,
    "minResTime" : 3473.0,
    "maxResTime" : 5705.0,
    "pct1ResTime" : 5422.7,
    "pct2ResTime" : 5476.4,
    "pct3ResTime" : 5704.86,
    "throughput" : 0.7307751331837681,
    "receivedKBytesPerSec" : 7.799861301163394,
    "sentKBytesPerSec" : 0.32742151475069603
  },
  "06 GET /api/patients (paginated list)" : {
    "transaction" : "06 GET /api/patients (paginated list)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 176.66,
    "medianResTime" : 166.0,
    "minResTime" : 113.0,
    "maxResTime" : 400.0,
    "pct1ResTime" : 227.60000000000002,
    "pct2ResTime" : 255.79999999999995,
    "pct3ResTime" : 398.96999999999946,
    "throughput" : 0.7535567880395466,
    "receivedKBytesPerSec" : 7.405814820954907,
    "sentKBytesPerSec" : 0.34797545194568363
  }
}