jmeter/results/optimized/light-report/statistics.json
{
  "07 GET /api/patients?search= (name search)" : {
    "transaction" : "07 GET /api/patients?search= (name search)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.490000000000004,
    "medianResTime" : 6.0,
    "minResTime" : 1.0,
    "maxResTime" : 67.0,
    "pct1ResTime" : 24.0,
    "pct2ResTime" : 64.0,
    "pct3ResTime" : 66.97999999999999,
    "throughput" : 0.8684551052133359,
    "receivedKBytesPerSec" : 2.12042982285687,
    "sentKBytesPerSec" : 0.408784531946121
  },
  "02 GET / (index.html)" : {
    "transaction" : "02 GET / (index.html)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.15,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 70.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 63.89999999999998,
    "pct3ResTime" : 69.96999999999998,
    "throughput" : 0.8677693122060431,
    "receivedKBytesPerSec" : 1.5211385892674292,
    "sentKBytesPerSec" : 0.37625935021433904
  },
  "09 GET /api/appointments (day view)" : {
    "transaction" : "09 GET /api/appointments (day view)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.369999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 33.34999999999985,
    "pct3ResTime" : 57.909999999999954,
    "throughput" : 0.8685079034219212,
    "receivedKBytesPerSec" : 1.531796888570436,
    "sentKBytesPerSec" : 0.3901500347403161
  },
  "04 GET /assets/index.css" : {
    "transaction" : "04 GET /assets/index.css",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.55,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 142.0,
    "pct1ResTime" : 29.600000000000136,
    "pct2ResTime" : 65.94999999999999,
    "pct3ResTime" : 141.26999999999964,
    "throughput" : 0.8677693122060431,
    "receivedKBytesPerSec" : 24.595836442840035,
    "sentKBytesPerSec" : 0.38981824571755846
  },
  "05 GET /api/dashboard/stats" : {
    "transaction" : "05 GET /api/dashboard/stats",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.300000000000002,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 100.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 72.84999999999951,
    "pct3ResTime" : 99.97999999999999,
    "throughput" : 0.8677015453764524,
    "receivedKBytesPerSec" : 1.0329800477452775,
    "sentKBytesPerSec" : 0.39232989795829826
  },
  "10 POST /api/ai/pre-appointment/{id}" : {
    "transaction" : "10 POST /api/ai/pre-appointment/{id}",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7079.6,
    "medianResTime" : 1624.5,
    "minResTime" : 1282.0,
    "maxResTime" : 55195.0,
    "pct1ResTime" : 49960.400000000016,
    "pct2ResTime" : 55195.0,
    "pct3ResTime" : 55195.0,
    "throughput" : 0.1150814201047241,
    "receivedKBytesPerSec" : 0.26656408236952644,
    "sentKBytesPerSec" : 0.055045780827435414
  },
  "01 POST /api/auth/login" : {
    "transaction" : "01 POST /api/auth/login",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 66.44,
    "medianResTime" : 63.0,
    "minResTime" : 59.0,
    "maxResTime" : 142.0,
    "pct1ResTime" : 68.80000000000001,
    "pct2ResTime" : 106.74999999999994,
    "pct3ResTime" : 141.7999999999999,
    "throughput" : 0.8667163584045485,
    "receivedKBytesPerSec" : 1.2577544029191008,
    "sentKBytesPerSec" : 0.44122972425419055
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 910,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 93.69890109890117,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 55195.0,
    "pct1ResTime" : 63.0,
    "pct2ResTime" : 67.0,
    "pct3ResTime" : 1484.029999999997,
    "throughput" : 7.614999037664957,
    "receivedKBytesPerSec" : 239.6915578896829,
    "sentKBytesPerSec" : 3.489371623982226
  },
  "03 GET /assets/index.js (main bundle)" : {
    "transaction" : "03 GET /assets/index.js (main bundle)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.69,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 130.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 67.0,
    "pct3ResTime" : 129.3999999999997,
    "throughput" : 0.8677542519958348,
    "receivedKBytesPerSec" : 198.00897854477614,
    "sentKBytesPerSec" : 0.38896406412703927
  },
  "08 GET /api/patients/{id} (record with history)" : {
    "transaction" : "08 GET /api/patients/{id} (record with history)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.929999999999996,
    "medianResTime" : 5.0,
    "minResTime" : 2.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 66.34999999999985,
    "pct3ResTime" : 100.74999999999987,
    "throughput" : 0.8684551052133359,
    "receivedKBytesPerSec" : 9.179129449746846,
    "sentKBytesPerSec" : 0.38912555798240506
  },
  "06 GET /api/patients (paginated list)" : {
    "transaction" : "06 GET /api/patients (paginated list)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.779999999999994,
    "medianResTime" : 14.0,
    "minResTime" : 2.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 27.80000000000001,
    "pct2ResTime" : 71.74999999999994,
    "pct3ResTime" : 82.97999999999999,
    "throughput" : 0.8682213617183837,
    "receivedKBytesPerSec" : 9.119351202595114,
    "sentKBytesPerSec" : 0.40088256058014554
  }
}