jmeter/results/optimized/moderate-report/statistics.json
{
  "07 GET /api/patients?search= (name search)" : {
    "transaction" : "07 GET /api/patients?search= (name search)",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.575999999999993,
    "medianResTime" : 6.0,
    "minResTime" : 1.0,
    "maxResTime" : 139.0,
    "pct1ResTime" : 64.0,
    "pct2ResTime" : 67.0,
    "pct3ResTime" : 130.49,
    "throughput" : 3.2201141208444426,
    "receivedKBytesPerSec" : 5.938230060248335,
    "sentKBytesPerSec" : 1.5157177795381067
  },
  "02 GET / (index.html)" : {
    "transaction" : "02 GET / (index.html)",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.555999999999999,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 95.0,
    "pct1ResTime" : 6.900000000000006,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 69.0,
    "throughput" : 3.2168821977739173,
    "receivedKBytesPerSec" : 5.638968305668146,
    "sentKBytesPerSec" : 1.3948200154410344
  },
  "09 GET /api/appointments (day view)" : {
    "transaction" : "09 GET /api/appointments (day view)",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.956000000000003,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 61.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 32.0,
    "pct3ResTime" : 53.98000000000002,
    "throughput" : 3.2203215169002473,
    "receivedKBytesPerSec" : 5.679628225957079,
    "sentKBytesPerSec" : 1.4466288064200328
  },
  "04 GET /assets/index.css" : {
    "transaction" : "04 GET /assets/index.css",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.883999999999999,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 128.0,
    "pct1ResTime" : 63.0,
    "pct2ResTime" : 69.44999999999999,
    "pct3ResTime" : 128.0,
    "throughput" : 3.216840804982243,
    "receivedKBytesPerSec" : 91.17733156621546,
    "sentKBytesPerSec" : 1.445065205363117
  },
  "05 GET /api/dashboard/stats" : {
    "transaction" : "05 GET /api/dashboard/stats",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.779999999999992,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 164.0,
    "pct1ResTime" : 23.700000000000017,
    "pct2ResTime" : 62.0,
    "pct3ResTime" : 120.45000000000005,
    "throughput" : 3.21642693564573,
    "receivedKBytesPerSec" : 3.828967804370481,
    "sentKBytesPerSec" : 1.4543024132851299
  },
  "10 POST /api/ai/pre-appointment/{id}" : {
    "transaction" : "10 POST /api/ai/pre-appointment/{id}",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2854.039999999999,
    "medianResTime" : 1491.0,
    "minResTime" : 15.0,
    "maxResTime" : 39001.0,
    "pct1ResTime" : 1970.6000000000008,
    "pct2ResTime" : 27950.199999999975,
    "pct3ResTime" : 39001.0,
    "throughput" : 0.34903039356667176,
    "receivedKBytesPerSec" : 0.776988011678557,
    "sentKBytesPerSec" : 0.16694832692280845
  },
  "01 POST /api/auth/login" : {
    "transaction" : "01 POST /api/auth/login",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 75.71199999999997,
    "medianResTime" : 64.0,
    "minResTime" : 59.0,
    "maxResTime" : 190.0,
    "pct1ResTime" : 121.9,
    "pct2ResTime" : 128.45,
    "pct3ResTime" : 178.92000000000007,
    "throughput" : 3.2115513077436924,
    "receivedKBytesPerSec" : 4.660512932917117,
    "sentKBytesPerSec" : 1.5668857747546376
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2275,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 51.67999999999996,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 39001.0,
    "pct1ResTime" : 65.0,
    "pct2ResTime" : 95.39999999999964,
    "pct3ResTime" : 459.71999999981927,
    "throughput" : 27.76896223421136,
    "receivedKBytesPerSec" : 873.0640994807815,
    "sentKBytesPerSec" : 12.65968345290262
  },
  "03 GET /assets/index.js (main bundle)" : {
    "transaction" : "03 GET /assets/index.js (main bundle)",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.020000000000003,
    "medianResTime" : 4.5,
    "minResTime" : 1.0,
    "maxResTime" : 261.0,
    "pct1ResTime" : 70.9,
    "pct2ResTime" : 121.39999999999986,
    "pct3ResTime" : 226.99000000000046,
    "throughput" : 3.216840804982243,
    "receivedKBytesPerSec" : 734.0365782946884,
    "sentKBytesPerSec" : 1.4419237592645016
  },
  "08 GET /api/patients/{id} (record with history)" : {
    "transaction" : "08 GET /api/patients/{id} (record with history)",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.195999999999987,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 133.0,
    "pct1ResTime" : 55.80000000000001,
    "pct2ResTime" : 64.0,
    "pct3ResTime" : 111.47000000000003,
    "throughput" : 3.22040448280304,
    "receivedKBytesPerSec" : 34.98910345951952,
    "sentKBytesPerSec" : 1.4429047444609044
  },
  "06 GET /api/patients (paginated list)" : {
    "transaction" : "06 GET /api/patients (paginated list)",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.204000000000015,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 174.0,
    "pct1ResTime" : 52.0,
    "pct2ResTime" : 75.0,
    "pct3ResTime" : 128.96000000000004,
    "throughput" : 3.21949209292742,
    "receivedKBytesPerSec" : 33.7645490859862,
    "sentKBytesPerSec" : 1.4865375932042961
  }
}